#ifndef CV_CVTCOLOR_HPP_
#define CV_CVTCOLOR_HPP_

/* reference: include/opencv2/imgproc.hpp
              imgproc/src/color.cpp
*/

#include <cmath>
#include <limits>

#include <typeinfo>
#include "mat.hpp"
#include "saturate.hpp"
#include "imgproc.hpp"
#include "core.hpp"

#define  CV_DESCALE(x,n)     (((x) + (1 << ((n)-1))) >> (n))

template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2Gray(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_Gray2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2YCrCb(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs_f, const int* coeffs_i);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_YCrCb2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs_f, const int* coeffs_i);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2XYZ(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_XYZ2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2HSV(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, int hrange);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2HLS(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, int hrange);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_HSV2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, int hrange);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_HLS2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, int hrange);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2Lab(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs, const float* whitept, bool srgb);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_RGB2Luv(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs, const float* whitept, bool srgb);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_Lab2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs, const float* whitept, bool srgb);
template<typename _Tp, int chs1, int chs2> static int CvtColorLoop_Luv2RGB(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int bidx, const float* coeffs, const float* whitept, bool srgb);
template<typename _Tp, int chs, int bIdx, int uIdx> inline void cvtYUV420sp2RGB(Mat_<_Tp, chs>& _dst, int _stride, const uchar* _y1, const uchar* _uv);
template<typename _Tp, int chs, int bIdx, int uIdx> inline void cvtYUV420sp2RGBA(Mat_<_Tp, chs>& _dst, int _stride, const uchar* _y1, const uchar* _uv);
template<typename _Tp, int chs, int bIdx> inline void cvtYUV420p2RGB(Mat_<_Tp, chs>& _dst, int _stride, const uchar* _y1, const uchar* _u, const uchar* _v, int ustepIdx, int vstepIdx);
template<typename _Tp, int chs, int bIdx> inline void cvtYUV420p2RGBA(Mat_<_Tp, chs>& _dst, int _stride, const uchar* _y1, const uchar* _u, const uchar* _v, int ustepIdx, int vstepIdx);
template<typename _Tp, int chs1, int chs2, int bIdx, int uIdx> static void cvtRGBtoYUV420p(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst);


#undef R2Y
#undef G2Y
#undef B2Y

enum {
	yuv_shift = 14,
	xyz_shift = 12,
	R2Y = 4899,
	G2Y = 9617,
	B2Y = 1868,
	BLOCK_SIZE = 256
};

// Converts an image from one color space to another
// support type: uchar/ushort/float
template<typename _Tp, int chs1, int chs2>
int cvtColor(const Mat_<_Tp, chs1>& src, Mat_<_Tp, chs2>& dst, int code)
{
	CV_Assert(src.cols > 0 &&  src.rows > 0 && dst.cols > 0 && dst.rows > 0);
	CV_Assert(src.cols == dst.cols);
	CV_Assert(src.data != NULL && dst.data != NULL);
	CV_Assert(typeid(uchar).name() == typeid(_Tp).name() ||
		typeid(ushort).name() == typeid(_Tp).name() ||
		typeid(float).name() == typeid(_Tp).name());
	CV_Assert((sizeof(_Tp) == 1) || sizeof(_Tp) == 2 || sizeof(_Tp) == 4); // uchar || ushort || float

	int scn = src.channels;
	int dcn = dst.channels; // number of channels in the destination image
	Size sz = src.size();
	Size dz = dst.size();
	int bidx;

	switch (code) {
		case CV_BGR2BGRA: case CV_RGB2BGRA: case CV_BGRA2BGR:
		case CV_RGBA2BGR: case CV_RGB2BGR: case CV_BGRA2RGBA: {
			CV_Assert(scn == 3 || scn == 4);
			dcn = code == CV_BGR2BGRA || code == CV_RGB2BGRA || code == CV_BGRA2RGBA ? 4 : 3;
			CV_Assert(dst.channels == dcn);
			bidx = code == CV_BGR2BGRA || code == CV_BGRA2BGR ? 0 : 2;

			CvtColorLoop_RGB2RGB(src, dst, bidx); // uchar/ushort/float
			break;
		}
		case CV_BGR2GRAY: case CV_BGRA2GRAY: case CV_RGB2GRAY: case CV_RGBA2GRAY: {
			CV_Assert(scn == 3 || scn == 4);
			CV_Assert(dst.channels == 1);
			bidx = code == CV_BGR2GRAY || code == CV_BGRA2GRAY ? 0 : 2;

			CvtColorLoop_RGB2Gray(src, dst, bidx);
			break;
		}
		case CV_GRAY2BGR: case CV_GRAY2BGRA: {
			CV_Assert(scn == 1 && (dcn == 3 || dcn == 4));

			CvtColorLoop_Gray2RGB(src, dst);
			break;
		}
		case CV_BGR2YCrCb: case CV_RGB2YCrCb:
		case CV_BGR2YUV: case CV_RGB2YUV: {
			CV_Assert(scn == 3 || scn == 4);
			bidx = code == CV_BGR2YCrCb || code == CV_BGR2YUV ? 0 : 2;
			static const float yuv_f[] = { 0.114f, 0.587f, 0.299f, 0.492f, 0.877f };
			static const int yuv_i[] = { B2Y, G2Y, R2Y, 8061, 14369 };
			const float* coeffs_f = code == CV_BGR2YCrCb || code == CV_RGB2YCrCb ? 0 : yuv_f;
			const int* coeffs_i = code == CV_BGR2YCrCb || code == CV_RGB2YCrCb ? 0 : yuv_i;

			CvtColorLoop_RGB2YCrCb(src, dst, bidx, coeffs_f, coeffs_i);
			break;
		}
		case CV_YCrCb2BGR: case CV_YCrCb2RGB:
		case CV_YUV2BGR: case CV_YUV2RGB: {
			CV_Assert(scn == 3 && (dcn == 3 || dcn == 4));
			bidx = code == CV_YCrCb2BGR || code == CV_YUV2BGR ? 0 : 2;
			static const float yuv_f[] = { 2.032f, -0.395f, -0.581f, 1.140f };
			static const int yuv_i[] = { 33292, -6472, -9519, 18678 };
			const float* coeffs_f = code == CV_YCrCb2BGR || code == CV_YCrCb2RGB ? 0 : yuv_f;
			const int* coeffs_i = code == CV_YCrCb2BGR || code == CV_YCrCb2RGB ? 0 : yuv_i;

			CvtColorLoop_YCrCb2RGB(src, dst, bidx, coeffs_f, coeffs_i);
			break;
		}
		case CV_BGR2XYZ: case CV_RGB2XYZ: {
			CV_Assert(scn == 3 || scn == 4);
			bidx = code == CV_BGR2XYZ ? 0 : 2;

			CvtColorLoop_RGB2XYZ(src, dst, bidx);
			break;
		}
		case CV_XYZ2BGR: case CV_XYZ2RGB: {
			CV_Assert(scn == 3 && (dcn == 3 || dcn == 4));
			bidx = code == CV_XYZ2BGR ? 0 : 2;

			CvtColorLoop_XYZ2RGB(src, dst, bidx);
			break;
		}
		case CV_BGR2HSV: case CV_RGB2HSV: case CV_BGR2HSV_FULL: case CV_RGB2HSV_FULL:
		case CV_BGR2HLS: case CV_RGB2HLS: case CV_BGR2HLS_FULL: case CV_RGB2HLS_FULL: {
			CV_Assert(scn == 3 || scn == 4);
			CV_Assert(sizeof(_Tp) == 1 || sizeof(_Tp) == 4);
			bidx = code == CV_BGR2HSV || code == CV_BGR2HLS ||
				code == CV_BGR2HSV_FULL || code == CV_BGR2HLS_FULL ? 0 : 2;
			int hrange = sizeof(_Tp) == 4 ? 360 : code == CV_BGR2HSV || code == CV_RGB2HSV ||
				code == CV_BGR2HLS || code == CV_RGB2HLS ? 180 : 256;

			if (code == CV_BGR2HSV || code == CV_RGB2HSV || code == CV_BGR2HSV_FULL || code == CV_RGB2HSV_FULL) {
				CvtColorLoop_RGB2HSV(src, dst, bidx, hrange);
			} else {
				CvtColorLoop_RGB2HLS(src, dst, bidx, hrange);
			}
			break;
		}
		case CV_HSV2BGR: case CV_HSV2RGB: case CV_HSV2BGR_FULL: case CV_HSV2RGB_FULL:
		case CV_HLS2BGR: case CV_HLS2RGB: case CV_HLS2BGR_FULL: case CV_HLS2RGB_FULL: {
			CV_Assert(scn == 3 && (dcn == 3 || dcn == 4));
			CV_Assert(sizeof(_Tp) == 1 || sizeof(_Tp) == 4);
			bidx = code == CV_HSV2BGR || code == CV_HLS2BGR ||
				code == CV_HSV2BGR_FULL || code == CV_HLS2BGR_FULL ? 0 : 2;
			int hrange = sizeof(_Tp) == 4 ? 360 : code == CV_HSV2BGR || code == CV_HSV2RGB ||
				code == CV_HLS2BGR || code == CV_HLS2RGB ? 180 : 255;

			if (code == CV_HSV2BGR || code == CV_HSV2RGB || code == CV_HSV2BGR_FULL || code == CV_HSV2RGB_FULL) {
				CvtColorLoop_HSV2RGB(src, dst, bidx, hrange);
			} else {
				CvtColorLoop_HLS2RGB(src, dst, bidx, hrange);
			}
			break;
		}
		case CV_BGR2Lab: case CV_RGB2Lab:
		case CV_BGR2Luv: case CV_RGB2Luv: {
			CV_Assert(scn == 3 || scn == 4);
			CV_Assert(sizeof(_Tp) == 1 || sizeof(_Tp) == 4);
			bidx = code == CV_BGR2Lab || code == CV_BGR2Luv ? 0 : 2;
			bool srgb = code == CV_BGR2Lab || code == CV_RGB2Lab || code == CV_BGR2Luv || code == CV_RGB2Luv;

			if (code == CV_BGR2Lab || code == CV_RGB2Lab) {
				CvtColorLoop_RGB2Lab(src, dst, bidx, 0, 0, srgb);
			} else {
				CvtColorLoop_RGB2Luv(src, dst, bidx, 0, 0, srgb);
			}
			break;
		}
		case CV_Lab2BGR: case CV_Lab2RGB:
		case CV_Luv2BGR: case CV_Luv2RGB: {
			CV_Assert(scn == 3 && (dcn == 3 || dcn == 4));
			CV_Assert(sizeof(_Tp) == 1 || sizeof(_Tp) == 4);
			bidx = code == CV_Lab2BGR || code == CV_Luv2BGR ? 0 : 2;
			bool srgb = code == CV_Lab2BGR || code == CV_Lab2RGB || code == CV_Luv2BGR || code == CV_Luv2RGB;

			if (code == CV_Lab2BGR || code == CV_Lab2RGB) {
				CvtColorLoop_Lab2RGB(src, dst, bidx, 0, 0, srgb);
			} else {
				CvtColorLoop_Luv2RGB(src, dst, bidx, 0, 0, srgb);
			}
			break;
		}
		case CV_YUV2BGR_NV21:  case CV_YUV2RGB_NV21:  case CV_YUV2BGR_NV12:  case CV_YUV2RGB_NV12:
		case CV_YUV2BGRA_NV21: case CV_YUV2RGBA_NV21: case CV_YUV2BGRA_NV12: case CV_YUV2RGBA_NV12: {
			// http://www.fourcc.org/yuv.php#NV21 == yuv420sp -> a plane of 8 bit Y samples followed by an interleaved V/U plane containing 8 bit 2x2 subsampled chroma samples
			// http://www.fourcc.org/yuv.php#NV12 -> a plane of 8 bit Y samples followed by an interleaved U/V plane containing 8 bit 2x2 subsampled colour difference samples

			dcn = (code == CV_YUV420sp2BGRA || code == CV_YUV420sp2RGBA || code == CV_YUV2BGRA_NV12 || code == CV_YUV2RGBA_NV12) ? 4 : 3;
			CV_Assert(dcn == dst.channels);
			const int bIdx = (code == CV_YUV2BGR_NV21 || code == CV_YUV2BGRA_NV21 || code == CV_YUV2BGR_NV12 || code == CV_YUV2BGRA_NV12) ? 0 : 2;
			const int uIdx = (code == CV_YUV2BGR_NV21 || code == CV_YUV2BGRA_NV21 || code == CV_YUV2RGB_NV21 || code == CV_YUV2RGBA_NV21) ? 1 : 0;

			CV_Assert(dcn == 3 || dcn == 4);
			CV_Assert(sz.width % 2 == 0 && sz.height % 3 == 0);
			CV_Assert(sizeof(_Tp) == 1);
			//Size dstSz(sz.width, sz.height * 2 / 3);
			CV_Assert((sz.width == dz.width) && (dz.height = sz.height * 2 / 3));

			int srcstep = (int)src.step;
			const uchar* y = src.ptr();
			const uchar* uv = y + srcstep * dz.height;

			switch (dcn * 100 + bIdx * 10 + uIdx) {
				case 300: cvtYUV420sp2RGB<_Tp, chs2, 0, 0>(dst, srcstep, y, uv); break;
				case 301: cvtYUV420sp2RGB<_Tp, chs2, 0, 1>(dst, srcstep, y, uv); break;
				case 320: cvtYUV420sp2RGB<_Tp, chs2, 2, 0>(dst, srcstep, y, uv); break;
				case 321: cvtYUV420sp2RGB<_Tp, chs2, 2, 1>(dst, srcstep, y, uv); break;
				case 400: cvtYUV420sp2RGBA<_Tp, chs2, 0, 0>(dst, srcstep, y, uv); break;
				case 401: cvtYUV420sp2RGBA<_Tp, chs2, 0, 1>(dst, srcstep, y, uv); break;
				case 420: cvtYUV420sp2RGBA<_Tp, chs2, 2, 0>(dst, srcstep, y, uv); break;
				case 421: cvtYUV420sp2RGBA<_Tp, chs2, 2, 1>(dst, srcstep, y, uv); break;
				default: CV_Error("Unknown/unsupported color conversion code"); break;
			};
			break;
		}
		case CV_YUV2BGR_YV12: case CV_YUV2RGB_YV12: case CV_YUV2BGRA_YV12: case CV_YUV2RGBA_YV12:
		case CV_YUV2BGR_IYUV: case CV_YUV2RGB_IYUV: case CV_YUV2BGRA_IYUV: case CV_YUV2RGBA_IYUV: {
			//http://www.fourcc.org/yuv.php#YV12 == yuv420p -> It comprises an NxM Y plane followed by (N/2)x(M/2) V and U planes.
			//http://www.fourcc.org/yuv.php#IYUV == I420 -> It comprises an NxN Y plane followed by (N/2)x(N/2) U and V planes

			dcn = (code == CV_YUV2BGRA_YV12 || code == CV_YUV2RGBA_YV12 || code == CV_YUV2RGBA_IYUV || code == CV_YUV2BGRA_IYUV) ? 4 : 3;
			CV_Assert(dcn == dst.channels);
			const int bIdx = (code == CV_YUV2BGR_YV12 || code == CV_YUV2BGRA_YV12 || code == CV_YUV2BGR_IYUV || code == CV_YUV2BGRA_IYUV) ? 0 : 2;
			const int uIdx = (code == CV_YUV2BGR_YV12 || code == CV_YUV2RGB_YV12 || code == CV_YUV2BGRA_YV12 || code == CV_YUV2RGBA_YV12) ? 1 : 0;

			CV_Assert(dcn == 3 || dcn == 4);
			CV_Assert(sz.width % 2 == 0 && sz.height % 3 == 0);
			CV_Assert(sizeof(_Tp) == 1);

			//Size dstSz(sz.width, sz.height * 2 / 3);
			CV_Assert((sz.width == dz.width) && (dz.height = sz.height * 2 / 3));

			int srcstep = (int)src.step;
			const uchar* y = src.ptr();
			const uchar* u = y + srcstep * dz.height;
			const uchar* v = y + srcstep * (dz.height + dz.height / 4) + (dz.width / 2) * ((dz.height % 4) / 2);

			int ustepIdx = 0;
			int vstepIdx = dz.height % 4 == 2 ? 1 : 0;

			if (uIdx == 1) { std::swap(u, v), std::swap(ustepIdx, vstepIdx); }

			switch (dcn * 10 + bIdx) {
				case 30: cvtYUV420p2RGB<_Tp, chs2, 0>(dst, srcstep, y, u, v, ustepIdx, vstepIdx); break;
				case 32: cvtYUV420p2RGB<_Tp, chs2, 2>(dst, srcstep, y, u, v, ustepIdx, vstepIdx); break;
				case 40: cvtYUV420p2RGBA<_Tp, chs2, 0>(dst, srcstep, y, u, v, ustepIdx, vstepIdx); break;
				case 42: cvtYUV420p2RGBA<_Tp, chs2, 2>(dst, srcstep, y, u, v, ustepIdx, vstepIdx); break;
				default: CV_Error("Unknown/unsupported color conversion code"); break;
			};
			break;
		}
		case CV_YUV2GRAY_420: {
			CV_Assert(dcn == 1 && scn == 1);
			CV_Assert(sz.width % 2 == 0 && sz.height % 3 == 0);
			CV_Assert(sizeof(_Tp) == 1);

			//Size dstSz(sz.width, sz.height * 2 / 3);
			CV_Assert((sz.width == dz.width) && (dz.height = sz.height * 2 / 3));

			//src.copyTo(dst, Rect(0, 0, sz.width, dz.height));
			memcpy(dst.data, src.data, dz.area());

			break;
		}
		case CV_RGB2YUV_YV12: case CV_BGR2YUV_YV12: case CV_RGBA2YUV_YV12: case CV_BGRA2YUV_YV12:
		case CV_RGB2YUV_IYUV: case CV_BGR2YUV_IYUV: case CV_RGBA2YUV_IYUV: case CV_BGRA2YUV_IYUV: {
			const int bIdx = (code == CV_BGR2YUV_IYUV || code == CV_BGRA2YUV_IYUV || code == CV_BGR2YUV_YV12 || code == CV_BGRA2YUV_YV12) ? 0 : 2;
			const int uIdx = (code == CV_BGR2YUV_IYUV || code == CV_BGRA2YUV_IYUV || code == CV_RGB2YUV_IYUV || code == CV_RGBA2YUV_IYUV) ? 1 : 2;

			CV_Assert(scn == 3 || scn == 4);
			CV_Assert(sizeof(_Tp) == 1);
			CV_Assert(dcn == 1);
			CV_Assert(sz.width % 2 == 0 && sz.height % 2 == 0);

			//Size dstSz(sz.width, sz.height / 2 * 3);
			CV_Assert((dz.width == sz.width) && (sz.height / 2 * 3 == dz.height));

			switch (bIdx + uIdx * 10) {
				case 10: cvtRGBtoYUV420p<_Tp, chs1, chs2, 0, 1>(src, dst); break;
				case 12: cvtRGBtoYUV420p<_Tp, chs1, chs2, 2, 1>(src, dst); break;
				case 20: cvtRGBtoYUV420p<_Tp, chs1, chs2, 0, 2>(src, dst); break;
				case 22: cvtRGBtoYUV420p<_Tp, chs1, chs2, 2, 2>(src, dst); break;
				default: CV_Error("Unknown/unsupported color conversion code"); break;
			};

			break;
		}
		default:
			CV_Error("Unknown/unsupported color conversion code");
	}

	return 0;
}

// computes cubic spline coefficients for a function: (xi=i, yi=f[i]), i=0..n
template<typename _Tp> static void splineBuild(const _Tp* f, int n, _Tp* tab)
{
	_Tp cn = 0;
	int i;
	tab[0] = tab[1] = (_Tp)0;

	for (i = 1; i < n - 1; i++) {
